; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 11333)
	(= (fuel plane1) 1088)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city1)
	(= (capacity plane2) 2106)
	(= (fuel plane2) 552)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at person1 city3)
	(at person2 city3)
	(at person3 city6)
	(at person4 city9)
	(at person5 city7)
	(at person6 city4)
	(at person7 city7)
	(at person8 city2)
	(at person9 city8)
	(at person10 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 921)
	(= (distance city0 city2) 589)
	(= (distance city0 city3) 971)
	(= (distance city0 city4) 752)
	(= (distance city0 city5) 976)
	(= (distance city0 city6) 723)
	(= (distance city0 city7) 998)
	(= (distance city0 city8) 984)
	(= (distance city0 city9) 803)
	(= (distance city1 city0) 921)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 817)
	(= (distance city1 city3) 772)
	(= (distance city1 city4) 671)
	(= (distance city1 city5) 972)
	(= (distance city1 city6) 559)
	(= (distance city1 city7) 974)
	(= (distance city1 city8) 998)
	(= (distance city1 city9) 516)
	(= (distance city2 city0) 589)
	(= (distance city2 city1) 817)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 787)
	(= (distance city2 city4) 869)
	(= (distance city2 city5) 659)
	(= (distance city2 city6) 929)
	(= (distance city2 city7) 502)
	(= (distance city2 city8) 904)
	(= (distance city2 city9) 786)
	(= (distance city3 city0) 971)
	(= (distance city3 city1) 772)
	(= (distance city3 city2) 787)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 971)
	(= (distance city3 city5) 582)
	(= (distance city3 city6) 608)
	(= (distance city3 city7) 925)
	(= (distance city3 city8) 778)
	(= (distance city3 city9) 525)
	(= (distance city4 city0) 752)
	(= (distance city4 city1) 671)
	(= (distance city4 city2) 869)
	(= (distance city4 city3) 971)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 994)
	(= (distance city4 city6) 700)
	(= (distance city4 city7) 614)
	(= (distance city4 city8) 965)
	(= (distance city4 city9) 952)
	(= (distance city5 city0) 976)
	(= (distance city5 city1) 972)
	(= (distance city5 city2) 659)
	(= (distance city5 city3) 582)
	(= (distance city5 city4) 994)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 590)
	(= (distance city5 city7) 689)
	(= (distance city5 city8) 951)
	(= (distance city5 city9) 575)
	(= (distance city6 city0) 723)
	(= (distance city6 city1) 559)
	(= (distance city6 city2) 929)
	(= (distance city6 city3) 608)
	(= (distance city6 city4) 700)
	(= (distance city6 city5) 590)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 993)
	(= (distance city6 city8) 768)
	(= (distance city6 city9) 847)
	(= (distance city7 city0) 998)
	(= (distance city7 city1) 974)
	(= (distance city7 city2) 502)
	(= (distance city7 city3) 925)
	(= (distance city7 city4) 614)
	(= (distance city7 city5) 689)
	(= (distance city7 city6) 993)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 664)
	(= (distance city7 city9) 740)
	(= (distance city8 city0) 984)
	(= (distance city8 city1) 998)
	(= (distance city8 city2) 904)
	(= (distance city8 city3) 778)
	(= (distance city8 city4) 965)
	(= (distance city8 city5) 951)
	(= (distance city8 city6) 768)
	(= (distance city8 city7) 664)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 907)
	(= (distance city9 city0) 803)
	(= (distance city9 city1) 516)
	(= (distance city9 city2) 786)
	(= (distance city9 city3) 525)
	(= (distance city9 city4) 952)
	(= (distance city9 city5) 575)
	(= (distance city9 city6) 847)
	(= (distance city9 city7) 740)
	(= (distance city9 city8) 907)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city5)
	(at person1 city9)
	(at person2 city4)
	(at person3 city9)
	(at person4 city4)
	(at person5 city6)
	(at person6 city8)
	(at person7 city0)
	(at person8 city0)
	(at person9 city0)
	(at person10 city9)
	))

(:metric minimize (+ (* 2 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane2 city1)
   changed: (fuel plane2) from 552 to 2106
   goals met: 0 of 11
2. (fly plane2 city1 city9)
   deleted: (at plane2 city1)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 0 to 516, (fuel plane2) from 2106 to 1590
   goals met: 0 of 11
3. (board person4 plane2 city9)
   deleted: (at person4 city9)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 11
4. (fly plane2 city9 city3)
   deleted: (at plane2 city9)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 516 to 1041, (fuel plane2) from 1590 to 1065
   goals met: 0 of 11
5. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 11
6. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 0 of 11
7. (fly plane2 city3 city5)
   deleted: (at plane2 city3)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 1041 to 1623, (fuel plane2) from 1065 to 483
   goals met: 1 of 11
8. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 11
9. (board person10 plane2 city5)
   deleted: (at person10 city5)
   added: (in person10 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 1 of 11
10. (refuel plane2 city5)
   changed: (fuel plane2) from 483 to 2106
   goals met: 1 of 11
11. (fly plane2 city5 city7)
   deleted: (at plane2 city5)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 1623 to 2312, (fuel plane2) from 2106 to 1417
   goals met: 0 of 11
12. (board person5 plane2 city7)
   deleted: (at person5 city7)
   added: (in person5 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 0 of 11
13. (board person7 plane2 city7)
   deleted: (at person7 city7)
   added: (in person7 plane2)
   changed: (onboard plane2) from 5 to 6
   goals met: 0 of 11
14. (fly plane2 city7 city5)
   deleted: (at plane2 city7)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 2312 to 3001, (fuel plane2) from 1417 to 728
   goals met: 1 of 11
15. (refuel plane2 city5)
   changed: (fuel plane2) from 728 to 2106
   goals met: 1 of 11
16. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 1 of 11
17. (fly plane2 city5 city9)
   deleted: (at plane2 city5)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 3001 to 3576, (fuel plane2) from 2106 to 1531
   goals met: 0 of 11
18. (debark person1 plane2 city9)
   deleted: (in person1 plane2)
   added: (at person1 city9)
   changed: (onboard plane2) from 6 to 5
   goals met: 1 of 11
19. (debark person10 plane2 city9)
   deleted: (in person10 plane2)
   added: (at person10 city9)
   changed: (onboard plane2) from 5 to 4
   goals met: 2 of 11
20. (fly plane2 city9 city0)
   deleted: (at plane2 city9)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 3576 to 4379, (fuel plane2) from 1531 to 728
   goals met: 2 of 11
21. (debark person7 plane2 city0)
   deleted: (in person7 plane2)
   added: (at person7 city0)
   changed: (onboard plane2) from 4 to 3
   goals met: 3 of 11
22. (refuel plane2 city0)
   changed: (fuel plane2) from 728 to 2106
   goals met: 3 of 11
23. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 4379 to 5131, (fuel plane2) from 2106 to 1354
   goals met: 3 of 11
24. (debark person2 plane2 city4)
   deleted: (in person2 plane2)
   added: (at person2 city4)
   changed: (onboard plane2) from 3 to 2
   goals met: 4 of 11
25. (debark person4 plane2 city4)
   deleted: (in person4 plane2)
   added: (at person4 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 11
26. (board person6 plane2 city4)
   deleted: (at person6 city4)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 5 of 11
27. (fly plane2 city4 city9)
   deleted: (at plane2 city4)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 5131 to 6083, (fuel plane2) from 1354 to 402
   goals met: 5 of 11
28. (refuel plane2 city9)
   changed: (fuel plane2) from 402 to 2106
   goals met: 5 of 11
29. (fly plane2 city9 city6)
   deleted: (at plane2 city9)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 6083 to 6930, (fuel plane2) from 2106 to 1259
   goals met: 5 of 11
30. (debark person5 plane2 city6)
   deleted: (in person5 plane2)
   added: (at person5 city6)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 11
31. (board person3 plane2 city6)
   deleted: (at person3 city6)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 11
32. (fly plane2 city6 city9)
   deleted: (at plane2 city6)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 6930 to 7777, (fuel plane2) from 1259 to 412
   goals met: 6 of 11
33. (refuel plane2 city9)
   changed: (fuel plane2) from 412 to 2106
   goals met: 6 of 11
34. (debark person3 plane2 city9)
   deleted: (in person3 plane2)
   added: (at person3 city9)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 11
35. (fly plane2 city9 city8)
   deleted: (at plane2 city9)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 7777 to 8684, (fuel plane2) from 2106 to 1199
   goals met: 7 of 11
36. (debark person6 plane2 city8)
   deleted: (in person6 plane2)
   added: (at person6 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 11
37. (fly plane2 city8 city5)
   deleted: (at plane2 city8)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 8684 to 9635, (fuel plane2) from 1199 to 248
   goals met: 9 of 11
38. (board person8 plane1 city2)
   deleted: (at person8 city2)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 11
39. (refuel plane1 city2)
   changed: (fuel plane1) from 1088 to 11333
   goals met: 9 of 11
40. (fly plane1 city2 city8)
   deleted: (at plane1 city2)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 9635 to 14155, (fuel plane1) from 11333 to 6813
   goals met: 9 of 11
41. (board person9 plane1 city8)
   deleted: (at person9 city8)
   added: (in person9 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 9 of 11
42. (fly plane1 city8 city0)
   deleted: (at plane1 city8)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 14155 to 19075, (fuel plane1) from 6813 to 1893
   goals met: 9 of 11
43. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 10 of 11
44. (debark person9 plane1 city0)
   deleted: (in person9 plane1)
   added: (at person9 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 11 of 11
